# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = input("Введите число: ")
print(f'{a} -> {int(a[0]) + int(a[1]) + int(a[2])} ({a[0]} + {a[1]} + {a[2]})')
